app/controllers/talks_controller.rb

  def set_talk
    @talk = Talk.find_by(user_one_id: [params[:id], current_user.id], user_two_id:
    	[params[:id], current_user.id], team: params[:team_id])
---
SELECT  "talks".* FROM "talks" WHERE "talks"."user_one_id" IN (32, 30) AND "talks"."user_two_id" IN (32, 30) AND "talks"."team_id" = 13 LIMIT $1  [["LIMIT", 1]]