app/controllers/team_users_controller.rb

  def create
    @team_user = TeamUser.new(team_user_params)
    authorize! :create, @team_user

    respond_to do |format|
      if @team_user.save
---
INSERT INTO "team_users" ("user_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 55], ["team_id", 18], ["created_at", "2017-06-17 15:09:20.525132"], ["updated_at", "2017-06-17 15:09:20.525132"]]

  def destroy
    authorize! :destroy, @team_user
    @team_user.destroy
---
DELETE FROM "team_users" WHERE "team_users"."id" = $1  [["id", 13]]